#######################################
### 协方差分析                       ###
#######################################

###--- 协方差分析 ----------------------

### 示例1
# 转载自 http://www.cnblogs.com/jpld/p/4594003.html
# 背景参考 相关统计学知识.md

# 数据构造
# 施用3种肥料的苹果产量，其中苹果的初始重量作为协变量
Weight_Initial <- c(15,13,11,12,12,16,14,17,17,16,18,18,21,22,19,18,22,24,20,23,25,27,30,32)
Weight_Increment <- c(85,83,65,76,80,91,84,90,97,90,100,95,103,106,99,94,89,91,83,95,100,102,105,110)
feed=gl(3,8,24)
data_feed <- data.frame(Weight_Initial,Weight_Increment,feed)

# 协方差分析
library(HH)
m <- ancova(Weight_Increment~Weight_Initial+feed,data=data_feed)
summary(m)
# 协方差分析的P值非常小，说明结果非常显著，应该拒绝原假设，认为各因素在不同水平下的试验结果有显著差别，
# 即三种肥料对苹果产量有很大的影响。

### 示例2
# 请参考 http://blog.163.com/jiangfeng_data/blog/static/206414038201241011216899/
