############################################################
### 具有交互效应的双因子方差分析                             ###                     
############################################################

###--- 具有交互效应的双因素方差分析  ---------------------------
# 转载自 http://blog.163.com/jiangfeng_data/blog/static/206414038201241010348975/
# 例子来源于汤银才所著《R语言与统计分析》
# 有一个关于检验毒品强弱的试验，给48只白鼠注射3种毒药（因素A），同时有4种治疗方案（因素B），这样的试验在
# 每一种因素组合下都重复四次测试老鼠的存活时间，试分析毒药和治疗方案以及它们的交互作用对老鼠存活时间有无显著影响。
time<-c(0.31,0.45,0.46,0.43,0.82,1.1,0.88,0.72,0.43,0.45,0.63,0.76,0.45,0.71,0.66,0.62,
        0.36,0.29,0.4,0.23,0.92,0.61,0.49,1.24,0.44,0.35,0.31,0.4,0.56,1.02,0.71,0.38,
        0.22,0.21,0.18,0.23,0.3,0.37,0.38,0.29,0.23,0.25,0.24,0.22,0.3,0.36,0.31,0.33)
tox<-gl(3,16,48)
cure<-gl(4,4,48)
b<-data.frame(time,tox,cure)

# 方差分析
m1<-aov(time~tox+cure+tox:cure)
summary(m1)
# 由p值可以看出，可以看出tox,cure之间的交互作用不显著

# 在说明tox,cure的作用是否显著前，最好先考虑方差齐次性（从箱型图可以看出方差有很大差异）
bartlett.test(time~tox+cure,data=b)
# 由p值（p < 0.05）可以看出，方差齐次性不满足，这样方差分析结果值得商榷，此时需要结合其他方法再进行进一步分析。
